project/integrations/KNX_CREATE_CONTACT_01.00.0000/resources/application_289/inbound_290/resourcegroup_291/findPerson_REQUEST_RT.wsdl

<wsdl:definitions         targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/findPerson_REQUEST"     xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"     xmlns:errors="http://xmlns.oracle.com/adf/svc/errors/"     xmlns:orafault="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0"     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"     xmlns:tns="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/"     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"     xmlns:types="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/"     xmlns:ns0="http://xmlns.oracle.com/cloud/adapter/erp/findPerson_REQUEST/types"     xmlns:ns1="http://xmlns.oracle.com/cloud/adapter/erp/findPerson_REQUEST"    >    <casdk:RuntimeIntegrationModel xmlns:casdk="http://xml.oracle.com/wsdl/extensions">        <casdk:sourceWSDLMetadata>            <casdk:serviceName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/}PersonService</casdk:serviceName>            <casdk:portTypeName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/}PersonService</casdk:portTypeName>            <casdk:portName>PersonServiceSoapHttpPort</casdk:portName>            <casdk:endpointURL>ENDPOINT_URL</casdk:endpointURL>            <casdk:targetWSDLNS>http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/</casdk:targetWSDLNS>            <casdk:soapVersion>SOAP11</casdk:soapVersion>        </casdk:sourceWSDLMetadata>    </casdk:RuntimeIntegrationModel>    <plnk:partnerLinkType name="findPerson_plt">        <plnk:role name="findPerson_role">            <plnk:portType name="ns1:findPerson_REQUESTPortType"/>        </plnk:role>    </plnk:partnerLinkType>    <wsdl:types>        <xs:schema xmlns="http://xmlns.oracle.com/cloud/adapter/erp/findPerson_REQUEST/types" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/findPerson_REQUEST/types">            <xs:element name="findPerson" type="xs:anyType"/>            <xs:element name="findPersonResponse" type="xs:anyType"/>        </xs:schema>        <xs:schema xmlns="http://xmlns.oracle.com/adf/svc/errors/" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/adf/svc/errors/">            <xs:element name="ServiceErrorMessage" type="xs:anyType"/>        </xs:schema>    </wsdl:types>    <wsdl:message name="findPersonRequestMessage">        <wsdl:part name="parameters" element="ns0:findPerson"/>    </wsdl:message>    <wsdl:message name="findPersonResponseMessage">        <wsdl:part name="parameters" element="ns0:findPersonResponse"/>    </wsdl:message>    <wsdl:message name="ServiceException">        <wsdl:part name="parameters" element="errors:ServiceErrorMessage"/>    </wsdl:message>    <wsdl:portType name="findPerson_REQUESTPortType">        <wsdl:operation name="findPerson">            <cloud:CloudOperation xmlns:cloud="http://xml.oracle.com/types" targetOperation="findPerson"/>            <wsdl:input message="ns1:findPersonRequestMessage"/>            <wsdl:output message="ns1:findPersonResponseMessage"/>            <wsdl:fault name="ServiceException" message="ns1:ServiceException"/>        </wsdl:operation>    </wsdl:portType></wsdl:definitions>